Revit 2027 API
RibbonItemEventArgs.Application Property
 The current UIApplication.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UIApplication Application { get; }
Public ReadOnly Property Application As UIApplication
	Get
public:
property UIApplication^ Application {
	UIApplication^ get ();
}
member Application : UIApplication with get
Property Value
UIApplication
See Also
Reference
RibbonItemEventArgs Class
Autodesk.Revit.UI.Events Namespace